open-watt/urt/src/urt/driver/esp32/ow_shim.c
void ow_uart_close(unsigned port)
{
    if (port >= NUM_UARTS ||
        !atomic_exchange_explicit(&uart_initialized[port], false,
                                  memory_order_acq_rel))
        return;
    atomic_store_explicit(&uart_rx_ready[port], NULL, memory_order_release);
    if (uart_event_task[port])
    {
        configASSERT(xTaskGetCurrentTaskHandle() != uart_event_task[port]);
        uart_event_t shutdown = { .type = UART_EVENT_MAX };
        xQueueSendToFront(uart_event_queue[port], &shutdown, portMAX_DELAY);
        xSemaphoreTake(uart_event_task_done[port], portMAX_DELAY);
        uart_event_task[port] = NULL;
    }
    uart_driver_delete((uart_port_t)port);
    uart_event_queue[port] = NULL;
}

int32_t ow_uart_read(unsigned port, uint8_t *buf, int32_t len)
{
    if (port >= NUM_UARTS ||
        !atomic_load_explicit(&uart_initialized[port], memory_order_acquire) ||
        !buf || len <= 0)
        return 0;
    return uart_read_bytes((uart_port_t)port, buf, (uint32_t)len, 0);
}

int32_t ow_uart_write(unsigned port, const uint8_t *buf, int32_t len)
{
    if (port >= NUM_UARTS ||
        !atomic_load_explicit(&uart_initialized[port], memory_order_acquire) ||
        !buf || len <= 0)
        return 0;
    size_t available = 0;
    if (uart_get_tx_buffer_free_size((uart_port_t)port, &available) != ESP_OK)
        return -1;
    if ((size_t)len > available)
        len = (int32_t)available;
    return len > 0 ? uart_write_bytes((uart_port_t)port, buf, (size_t)len) : 0;
}

void ow_uart_poll(unsigned port)
{
    (void)port;
}

int32_t ow_uart_rx_pending(unsigned port)
{
    if (port >= NUM_UARTS ||
        !atomic_load_explicit(&uart_initialized[port], memory_order_acquire))
        return 0;
    size_t available = 0;
    return uart_get_buffered_data_len((uart_port_t)port, &available) == ESP_OK
        ? (int32_t)available : 0;
}

int ow_uart_tx_idle(unsigned port)
{
    if (port >= NUM_UARTS ||
        !atomic_load_explicit(&uart_initialized[port], memory_order_acquire))
        return 1;
    return uart_wait_tx_done((uart_port_t)port, 0) == ESP_OK;
}

int32_t ow_uart_flush(unsigned port)
{
    if (port >= NUM_UARTS ||
        !atomic_load_explicit(&uart_initialized[port], memory_order_acquire))
        return 0;
    return uart_wait_tx_done((uart_port_t)port, portMAX_DELAY) == ESP_OK ? 0 : -1;
}

int ow_uart_check_errors(unsigned port)
{
    if (port >= NUM_UARTS ||
        !atomic_load_explicit(&uart_initialized[port], memory_order_acquire))
        return 0;
    return (int)atomic_exchange_explicit(&uart_errors[port], 0,
                                          memory_order_relaxed);
}

// -- WiFi wrappers --

#if CONFIG_ESP_WIFI_ENABLED
#include "esp_wifi.h"
#include "esp_private/wifi.h"
#include "esp_event.h"
#include "esp_mac.h"

static int ow_wifi_refcount;

#ifdef OW_USE_LWIP
#include "esp_netif.h"

static esp_netif_t *ow_wifi_netif_sta;
static esp_netif_t *ow_wifi_netif_ap;
#endif

typedef void (*ow_wifi_event_cb_t)(int event_id, void *data, int data_len);

static ow_wifi_event_cb_t ow_wifi_sta_cb;
static ow_wifi_event_cb_t ow_wifi_ap_cb;

static void ow_wifi_event_handler(void *arg, esp_event_base_t base, int32_t event_id, void *event_data)
{
    if (base == WIFI_EVENT)
    {
        int data_len = 0;
        if (event_id == WIFI_EVENT_STA_DISCONNECTED && event_data)
            data_len = ((wifi_event_sta_disconnected_t *)event_data)->reason;

        switch (event_id)
        {
        case WIFI_EVENT_STA_CONNECTED:
        case WIFI_EVENT_STA_DISCONNECTED:
        case WIFI_EVENT_STA_START:
        case WIFI_EVENT_STA_STOP:
            if (ow_wifi_sta_cb)
                ow_wifi_sta_cb(event_id, event_data, data_len);
            break;

        case WIFI_EVENT_AP_START:
        case WIFI_EVENT_AP_STOP:
        case WIFI_EVENT_AP_STACONNECTED:
        case WIFI_EVENT_AP_STADISCONNECTED:
            if (ow_wifi_ap_cb)
                ow_wifi_ap_cb(event_id, event_data, 0);
            break;
        }
    }
#ifdef OW_USE_LWIP
    else if (base == IP_EVENT)
    {
        if (event_id == IP_EVENT_STA_GOT_IP && ow_wifi_sta_cb)
            ow_wifi_sta_cb(event_id, event_data, 0);
    }
#endif
}

int ow_wifi_init(void)
{
    if (ow_wifi_refcount++ > 0)
        return 0;

    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    esp_err_t err = esp_wifi_init(&cfg);
    if (err != ESP_OK)
    {
        ow_wifi_refcount--;
        return (int)err;
    }

    esp_event_handler_register(WIFI_EVENT, ESP_EVENT_ANY_ID, &ow_wifi_event_handler, NULL);

#ifdef OW_USE_LWIP
    // Create netifs before RX callbacks fire, so esp_netif_receive() has valid targets.
    if (!ow_wifi_netif_sta)
        ow_wifi_netif_sta = esp_netif_create_default_wifi_sta();
    if (!ow_wifi_netif_ap)
        ow_wifi_netif_ap = esp_netif_create_default_wifi_ap();
    esp_event_handler_register(IP_EVENT, IP_EVENT_STA_GOT_IP, &ow_wifi_event_handler, NULL);
#endif

    return 0;
}

void ow_wifi_deinit(void)
{
    if (--ow_wifi_refcount > 0)
        return;

    esp_wifi_stop();
    esp_wifi_deinit();

#ifdef OW_USE_LWIP
    if (ow_wifi_netif_sta)
    {
        esp_netif_destroy(ow_wifi_netif_sta);
        ow_wifi_netif_sta = NULL;
    }
    if (ow_wifi_netif_ap)
    {
        esp_netif_destroy(ow_wifi_netif_ap);
        ow_wifi_netif_ap = NULL;
    }
#endif
}

int ow_wifi_sta_config(const char *ssid, const char *password, const uint8_t *bssid)
{
    wifi_config_t cfg = {0};
    if (ssid)
    {
        size_t len = strlen(ssid);
        if (len > sizeof(cfg.sta.ssid) - 1) len = sizeof(cfg.sta.ssid) - 1;
        memcpy(cfg.sta.ssid, ssid, len);
    }
    if (password)
    {
        size_t len = strlen(password);
        if (len > sizeof(cfg.sta.password) - 1) len = sizeof(cfg.sta.password) - 1;
        memcpy(cfg.sta.password, password, len);
    }
    if (bssid)
    {
        memcpy(cfg.sta.bssid, bssid, 6);
        cfg.sta.bssid_set = true;
    }

    return esp_wifi_set_config(WIFI_IF_STA, &cfg) == ESP_OK ? 1 : 0;
}

int ow_wifi_ap_config(const char *ssid, const char *password, uint8_t channel, uint8_t max_conn, uint8_t hidden)
{
    wifi_config_t cfg = {0};
    if (ssid)
    {
        size_t len = strlen(ssid);
        if (len > sizeof(cfg.ap.ssid) - 1) len = sizeof(cfg.ap.ssid) - 1;
        memcpy(cfg.ap.ssid, ssid, len);
        cfg.ap.ssid_len = (uint8_t)len;
    }
    if (password)
    {
        size_t len = strlen(password);
        if (len > sizeof(cfg.ap.password) - 1) len = sizeof(cfg.ap.password) - 1;
        memcpy(cfg.ap.password, password, len);
        cfg.ap.authmode = (len > 0) ? WIFI_AUTH_WPA2_PSK : WIFI_AUTH_OPEN;
    }
    else
        cfg.ap.authmode = WIFI_AUTH_OPEN;

