open-watt/urt/src/urt/driver/esp32/ow_shim.c
    if (twai_node_transmit(handle, &slot->frame, 0) != ESP_OK)
    {
        atomic_fetch_and_explicit(&ctx->tx_used, ~(1u << index), memory_order_release);
        return false;
    }
    return true;
}

bool ow_can_receive(twai_node_handle_t handle, ow_can_frame_t *frame)
{
    ow_can_context_t *ctx = ow_can_find(handle);
    if (!ctx || !frame)
        return false;
    uint32_t tail = atomic_load_explicit(&ctx->rx_tail, memory_order_relaxed);
    uint32_t head = atomic_load_explicit(&ctx->rx_head, memory_order_acquire);
    if (tail == head)
        return false;
    *frame = ctx->rx[tail & (OW_CAN_RX_CAP - 1)];
    atomic_store_explicit(&ctx->rx_tail, tail + 1, memory_order_release);
    return true;
}

uint32_t ow_can_check_errors(twai_node_handle_t handle)
{
    ow_can_context_t *ctx = ow_can_find(handle);
    return ctx ? atomic_exchange_explicit(&ctx->errors, 0, memory_order_relaxed) : 0;
}

uint32_t ow_can_take_rx_drops(twai_node_handle_t handle)
{
    ow_can_context_t *ctx = ow_can_find(handle);
    return ctx ? atomic_exchange_explicit(&ctx->rx_drops, 0, memory_order_relaxed) : 0;
}

uint32_t ow_can_bus_state(twai_node_handle_t handle)
{
    twai_node_status_t status;
    return twai_node_get_info(handle, &status, NULL) == ESP_OK ? (uint32_t)status.state : (uint32_t)TWAI_ERROR_BUS_OFF;
}

uint32_t ow_can_tx_error_count(twai_node_handle_t handle)
{
    twai_node_status_t status;
    return twai_node_get_info(handle, &status, NULL) == ESP_OK ? status.tx_error_count : 0;
}

uint32_t ow_can_rx_error_count(twai_node_handle_t handle)
{
    twai_node_status_t status;
    return twai_node_get_info(handle, &status, NULL) == ESP_OK ? status.rx_error_count : 0;
}

size_t ow_can_rx_available(twai_node_handle_t handle)
{
    ow_can_context_t *ctx = ow_can_find(handle);
    if (!ctx)
        return 0;
    uint32_t head = atomic_load_explicit(&ctx->rx_head, memory_order_acquire);
    uint32_t tail = atomic_load_explicit(&ctx->rx_tail, memory_order_relaxed);
    return head - tail;
}

void ow_can_rx_flush(twai_node_handle_t handle)
{
    ow_can_context_t *ctx = ow_can_find(handle);
    if (!ctx)
        return;
    uint32_t head = atomic_load_explicit(&ctx->rx_head, memory_order_acquire);
    atomic_store_explicit(&ctx->rx_tail, head, memory_order_release);
}

bool ow_can_bus_recover(twai_node_handle_t handle)
{
    return twai_node_recover(handle) == ESP_OK;
}

#else // !SOC_TWAI_SUPPORTED

typedef struct twai_node_base *twai_node_handle_t;
typedef bool (*ow_can_rx_cb_t)(unsigned);
typedef struct {
    uint32_t id;
    uint8_t flags;
    uint8_t dlc;
    uint8_t data[8];
} ow_can_frame_t;

twai_node_handle_t ow_can_open(unsigned port, uint32_t bitrate, int tx_gpio, int rx_gpio, uint8_t sjw, uint8_t tseg1, uint8_t tseg2,
                               uint16_t brp, ow_can_rx_cb_t rx_cb)
{
    return NULL;
}
void ow_can_close(twai_node_handle_t handle) {}
bool ow_can_transmit(twai_node_handle_t handle, uint32_t id, uint8_t flags, uint8_t dlc, const uint8_t *data) { return false; }
bool ow_can_receive(twai_node_handle_t handle, ow_can_frame_t *frame) { return false; }
uint32_t ow_can_check_errors(twai_node_handle_t handle) { return 0; }
uint32_t ow_can_take_rx_drops(twai_node_handle_t handle) { return 0; }
uint32_t ow_can_bus_state(twai_node_handle_t handle) { return 3; } // CanBusState.bus_off
uint32_t ow_can_tx_error_count(twai_node_handle_t handle) { return 0; }
uint32_t ow_can_rx_error_count(twai_node_handle_t handle) { return 0; }
size_t ow_can_rx_available(twai_node_handle_t handle) { return 0; }
void ow_can_rx_flush(twai_node_handle_t handle) {}
bool ow_can_bus_recover(twai_node_handle_t handle) { return false; }

#endif // SOC_TWAI_SUPPORTED

#ifdef OW_USE_LWIP
// -- lwIP netdb wrappers (link-order fix) --
// D object references lwip_getaddrinfo/lwip_freeaddrinfo but the D object
// appears after liblwip.a in the link. These wrappers are in libmain.a
// which is linked with --whole-archive, ensuring they're always present.

int ow_lwip_getaddrinfo(const char *nodename, const char *servname, const struct addrinfo *hints, struct addrinfo **res)
{
    return lwip_getaddrinfo(nodename, servname, hints, res);
}

void ow_lwip_freeaddrinfo(struct addrinfo *ai)
{
    lwip_freeaddrinfo(ai);
}
#endif
